IDEA Open Model
NonConformityIssue Class
Compatible with IDEA StatiCa Beta 20.0
 Non-conformity issue
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Message.NonConformityIssue
 Namespace: IdeaRS.OpenModel.Message
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class NonConformityIssue
Public Class NonConformityIssue
The NonConformityIssue type exposes the following members.
Constructors
Name | Description
NonConformityIssue
 Constructor
Top
Properties
Name | Description
Description
 Description of the nonconformity
Guid
 Description of the nonconformity
Severity
 severity of this nonconformity
Top
See Also
Reference
IdeaRS.OpenModel.Message Namespace